logs/20240610-045841-dummy_file.00003235/iodepth=1/rw=write/fio.log
job: (g=0): rw=write, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=1
fio-3.35
Starting 1 process

job: (groupid=0, jobs=1): err= 0: pid=89454: Mon Jun 10 05:01:25 2024
  write: IOPS=127, BW=63.8MiB/s (66.9MB/s)(10.0GiB/160558msec); 0 zone resets
    slat (usec): min=59, max=34545, avg=87.13, stdev=322.90
    clat (usec): min=1581, max=160654, avg=7752.00, stdev=10028.77
     lat (usec): min=1642, max=160790, avg=7839.13, stdev=10053.32
    clat percentiles (usec):
     |  1.00th=[  1729],  5.00th=[  2089], 10.00th=[  2278], 20.00th=[  2540],
     | 30.00th=[  2933], 40.00th=[  3032], 50.00th=[  3326], 60.00th=[  3949],
     | 70.00th=[  5669], 80.00th=[ 11338], 90.00th=[ 21890], 95.00th=[ 28705],
     | 99.00th=[ 43254], 99.50th=[ 57410], 99.90th=[103285], 99.95th=[110625],
     | 99.99th=[126354]
   bw (  KiB/s): min=17408, max=109568, per=100.00%, avg=65361.43, stdev=18713.19, samples=320
   iops        : min=   34, max=  214, avg=127.63, stdev=36.53, samples=320
  lat (msec)   : 2=4.01%, 4=57.32%, 10=16.71%, 20=10.65%, 50=10.60%
  lat (msec)   : 100=0.61%, 250=0.10%
  cpu          : usr=0.10%, sys=1.00%, ctx=20496, majf=0, minf=7
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,20480,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=63.8MiB/s (66.9MB/s), 63.8MiB/s-63.8MiB/s (66.9MB/s-66.9MB/s), io=10.0GiB (10.7GB), run=160558-160558msec

Disk stats (read/write):
    md127: ios=0/20651, merge=0/0, ticks=0/164893, in_queue=164893, util=99.51%, aggrios=5182/13257, aggrmerge=380965/971355, aggrticks=13919/27587, aggrin_queue=45002, aggrutil=32.22%
  sdf: ios=5148/13211, merge=380644/969982, ticks=14838/32519, in_queue=50216, util=31.92%
  sdd: ios=5187/13288, merge=379868/972432, ticks=12317/22578, in_queue=38180, util=25.92%
  sdb: ios=5190/13241, merge=382586/972320, ticks=13226/22319, in_queue=38726, util=26.18%
  sdi: ios=5206/13256, merge=383432/971279, ticks=15149/31163, in_queue=50024, util=31.63%
  sdg: ios=5180/13238, merge=381799/970790, ticks=13184/30093, in_queue=46294, util=29.76%
  sde: ios=5211/13318, merge=379749/972147, ticks=13688/23924, in_queue=41571, util=27.08%
  sdc: ios=5211/13300, merge=381346/972322, ticks=14607/24605, in_queue=43911, util=27.54%
  sdh: ios=5127/13209, merge=378300/969571, ticks=14344/33501, in_queue=51094, util=32.22%